// --------------------------------------------------------------------------
// 연습: 다음 정보를 변수와 상수로 저장하고 콘솔에 출력하세요.
// --------------------------------------------------------------------------
// - 이름(상수)
let userName = '김효경'
// - 나이(변수)
let userAge = '30'
// - 학생 여부(상수)
const STUDENT_STATUS = '학생'
// - 모든 정보를 한 번에 출력해보세요.
console.log ('사용자 정보:', userName, userAge, STUDENT_STATUS)
// --------------------------------------------------------------------------
// 연습: 다음 계산을 변수를 사용하여 수행하세요.
// --------------------------------------------------------------------------
// - 숫자1(상수)
const NUMBER_A = 5
// - 숫자2(상수)
const NUMBER_B = 7
// - 결과(변수)
let result = NUMBER_A + NUMBER_B

console.log ('숫자 연산 결과:', NUMBER_A, NUMBER_B, result)
// --------------------------------------------------------------------------
// 연습: 다음 쇼핑 정보를 변수로 관리하세요.
// --------------------------------------------------------------------------
// - 상품명(상수)
const PRODUCT_NAME = '가방'
// - 가격(변수)
let product_price = 500_000
// - 재고 있음(변수)
let product_stock = 'available'
// - 할인율(상수)
const DISCOUNT_PERCENTAGE = '20%'
console.log ('쇼핑 정보:', PRODUCT_NAME, product_price, product_stock, DISCOUNT_PERCENTAGE)